backend/controllers/CommunityRealestateController.php

						}

					//获取小区
					$c_id = CommunityBasic::find()->select( 'community_id' )->where( [ 'community_name' => $sheet[ 'A' ] ] )->asArray()->one();
					if($c_id){
						//获取楼宇
						$b_id = CommunityBuilding::find()->select( [ 'building_id' ] )
								->andwhere( [ 'community_building.building_name' => $sheet[ 'B' ] ] )
								->andwhere(['community_id' => $c_id['community_id']])->asArray()->one();
---
SELECT `community_id` FROM `community_basic` WHERE `community_name`='水漾人家'
SELECT `building_id` FROM `community_building` WHERE (`community_building`.`building_name`='1栋') AND (`community_id`='14')

								//更新数据库记录
								$transaction = Yii::$app->db->beginTransaction(); //事务开始标记
								try {
									CommunityRealestate::updateAll(['acreage' => $sheet[ 'D' ]], 'realestate_id = :id',[':id' => $r_id['realestate_id']]);
---
UPDATE `community_realestate` SET `acreage`=135 WHERE realestate_id = '26193'