backend/controllers/CostrelationController.php

	public function actionIndex1( $realestate_id )
	{
		$searchModel = new CostRelationSearch();
		$r_id = CommunityRealestate::find()->select('room_name')->where(['realestate_id' => $realestate_id])->asArray()->one();
---
SELECT `room_name` FROM `community_realestate` WHERE `realestate_id`='176'

	public function actionB( $selected = null ) {
		if ( isset( $_POST[ 'depdrop_parents' ] ) ) {
			$id = $_POST[ 'depdrop_parents' ];
			$list = CommunityBuilding::find()->where( [ 'community_id' => $id ] )->all();
---
SELECT * FROM `community_building` WHERE `community_id`='14'

	public function actionR( $selected = null ) {
		if ( isset( $_POST[ 'depdrop_parents' ] ) ) {
			$id = $_POST[ 'depdrop_parents' ];
			$list = CommunityRealestate::find()
				->where( [ 'building_id' => $id ] )
				->orderBy( 'CONVERT(room_number USING gbk) ASC' )->all();
---
SELECT * FROM `community_realestate` WHERE `building_id`='10' ORDER BY CONVERT(room_number USING gbk)