backend/controllers/UserInvoiceController.php

SELECT `community_id` FROM `community_basic` WHERE `community_name`='水漾人家'
SELECT `building_id` FROM `community_building` WHERE (`community_id`='14') AND (`community_building`.`building_name`='4栋')
SELECT `realestate_id` FROM `community_realestate` WHERE (`community_id`='14') AND (`building_id`='14') AND (`community_realestate`.`room_name`='2103')
---
							return $this->redirect( Yii::$app->request->referrer );
						}
						//获取小区
						$c_id = CommunityBasic::find()->select( 'community_id' )->where( [ 'community_name' => $sheet[ 'A' ] ] )->asArray()->one();
						if ( $c_id ) {
							//获取楼宇
							$b_id = CommunityBuilding::find()->select( [ 'building_id' ] )
								->andwhere(['community_id' => $c_id['community_id']])
								->andwhere( [ 'community_building.building_name' => $sheet[ 'B' ] ] )
								->asArray()
								->one();

							if ( $b_id ) {
								//获取房号
								$r_id = CommunityRealestate::find()->select( [ 'realestate_id' ] )
									->andwhere(['community_id' => $c_id['community_id']])
									->andwhere( [ 'building_id' => $b_id[ 'building_id' ] ] )
									->andwhere( [ 'community_realestate.room_name' => $sheet[ 'C' ]] )
									->asArray()
									->one();

SELECT `cost_id`, `cost_name` FROM `cost_name` WHERE `cost_name`='电梯维护费'
---
								//获取费项
								if ( isset($r_id) ) {
									//获取费项
									$cost_id = CostName::find()->select( 'cost_id,cost_name' )->where( [ 'cost_name' => $sheet[ 'F' ] ] )->asArray()->one();

INSERT INTO `user_invoice` (`community_id`, `building_id`, `realestate_id`, `description`, `year`, `month`, `invoice_amount`, `create_time`, `invoice_status`) VALUES (14, 14, 26845, '电梯维护费', '2018', '1', '20', '1519376471', 0)
---
										$model->create_time = $f;
										$model->invoice_status = '0';

										$e = $model->save(); //保存

SELECT `cost_id` FROM `cost_relation` WHERE `realestate_id`='176'
SELECT `cost_id`, `cost_name` FROM `cost_name` WHERE (`cost_name`.`cost_name` NOT LIKE '%水费%') AND (`cost_id`='6')
---
	public function actionC( $id )
	{
		$model = new UserInvoice;
		$model->setScenario('c');

		$i = 1;
		$w = date( 'Y' );
		$y = [ $w - $i * 2 => $w - $i * 2, $w - $i => $w - $i, $w => $w, $w + 1 => $w + 1, $w + 2 => $w + 2, ];
		$m = [ '01' => '1', '02' => '2', '03' => '3', '04' => '4', '05' => '5', '06' => '6', '07' => '7', '08' => '8', '09' => '9', 10 => 10, 11 => 11, 12 => 12 ];
		$model->id = $id;

		$cost_id = CostRelation::find()->select( 'cost_id' )->where( [ 'realestate_id' => $id ] )->asArray()->all(); //获取关联费项序号（二维数组）
		$c_id = array_column( $cost_id, 'cost_id' ); //提取关联费项序号
		$cost_info = CostName::find()->select( 'cost_id, cost_name' )->andwhere( [ 'in','cost_id', $c_id ] )->asArray()->all();//获取关联费项信息

SELECT * FROM `user_invoice` WHERE `invoice_id` IN ('838', '862', '871', '872', '873', '863', '864', '865', '866', '867', '868', '869', '870', '850', '859', '860', '861', '851', '852', '853', '854', '855', '856', '857', '858', '847', '848', '849', '839', '840', '841', '842', '843', '844', '845', '846', '874', '875')
---
	protected function findModel( $id ) {
		if ( ( $model = UserInvoice::findOne( $id ) ) !== null ) {