backend/views/user/index.php

SELECT `community_name`, `community_basic`.`community_name` FROM `community_basic` ORDER BY `community_name`
---
	        ['attribute' => 'community_name',
			 'hAlign' => 'center',
			 'filterType'=>GridView::FILTER_SELECT2,
			 'filter' => CommunityBasic::find()
			          -> select(['community_name'])
			          -> orderBy('community_name')
			          -> indexBy('community_name')
			          -> column(),

SELECT `name`, `status`.`name` FROM `status` WHERE `property`='1' ORDER BY `name`
---
		    ['attribute' => 'name',
		   'hAlign' => 'center',
		   'filterType'=>GridView::FILTER_SELECT2,
		   'filter' => Status::find()
		            -> select(['name'])
		            -> where(['property'=>'1'])
		            -> orderBy('name')
	                -> indexBy('name')
	                -> column(),