common/models/User.php

    public static function findIdentity($id)
    {
        return static::findOne($id);
---
SELECT * FROM `sys_user` WHERE `id`='101'