backend/views/user-invoice/_search.php

	       		<?= $form->field($model, 'invoice_id') ?>
	       	</div>
	       	<div class="col-lg-1">
	       		<?= $form->field($model, 'community.community_name')->dropDownList([CommunityBasic::find()
		             -> select(['community_name'])
		             -> orderBy('community_name')
		             -> indexBy('community_name')
		             -> column()],['prompt' => '请选择']) ?>
---
SELECT `community_name`, `community_basic`.`community_name` FROM `community_basic` ORDER BY `community_name`