backend/views/user-invoice/index.php

SELECT `community_name`, `community_basic`.`community_name` FROM `community_basic` ORDER BY `community_name`
---
		[ 'attribute' => 'community.community_name',
			'pageSummary' => '合计：',
			'filterType' => GridView::FILTER_SELECT2,
			'filter' => CommunityBasic::find()->select( [ 'community_name' ] )->orderBy( 'community_name' )->indexBy( 'community_name' )->column(),