backend/views/order/index.php

SELECT `product_id` AS `id` FROM `order_products` WHERE `order_id`='1802159381722'
SELECT `realestate_id` AS `r_id` FROM `user_invoice` WHERE `invoice_id`='1109070'
SELECT `community_id` AS `community`, `building_id` AS `building`, `room_number` AS `number`, `room_name` AS `name` FROM `community_realestate` WHERE `realestate_id`='4134'
SELECT `community_name` AS `c_name` FROM `community_basic` WHERE `community_id`='22'
SELECT `building_name` AS `b_name` FROM `community_building` WHERE `building_id`='45'
SELECT `address` FROM `order_relationship_address` WHERE `order_id`='201802103566'
SELECT `community_id` AS `c`, `building_id` AS `b`, `room_number` AS `num`, `room_name` AS `nam` FROM `community_realestate` WHERE `realestate_id`='7909'
SELECT `community_name` AS `c_name` FROM `community_basic` WHERE `community_id`='28'
SELECT `building_name` AS `b_name` FROM `community_building` WHERE `building_id`='89'
---
			'value' => function ( $model ) {
				$l = strlen( $model[ 'account_id' ] );
				if ( $l <= 3 ) {
					$i_id = OrderProducts::find()->select( 'product_id as id' )->where( [ 'order_id' => $model[ 'order_id' ] ] )->asArray()->one();
					$invoice = UserInvoice::find()->select( 'realestate_id as r_id' )->where( [ 'invoice_id' => $i_id[ 'id' ] ] )->asArray()->one();
					$r = CommunityRealestate::find()->select( 'community_id as community, building_id as building, room_number as number, room_name as name' )->where( [ 'realestate_id' => $invoice[ 'r_id' ] ] )->asArray()->one();
					$c = CommunityBasic::find()->select( 'community_name as c_name' )->where( [ 'community_id' => $r[ 'community' ] ] )->asArray()->one();
					$b = CommunityBuilding::find()->select( 'building_name as b_name' )->where( [ 'building_id' => $r[ 'building' ] ] )->asArray()->one();
					return $c[ 'c_name' ] . '-' . $b[ 'b_name' ] . '-' . $r[ 'name' ];
				} else {
					$add = OrderRelationshipAddress::find()->select( 'address' )->where( [ 'order_id' => $model[ 'order_id' ] ] )->asArray()->one();
					if(strlen($add['address']) > 12){
						return $add[ 'address' ];
					}else{
						$r_info = CommunityRealestate::find()
							->select('community_id as c,building_id as b,room_number as num, room_name as nam')
							->where(['realestate_id' => $add[ 'address' ]])
							->asArray()
							->one();
						$c = CommunityBasic::find()
							->select('community_name as c_name')
							->where(['community_id' => $r_info['c']])
							->asArray()
							->one();
						$b = CommunityBuilding::find()
							->select('building_name as b_name')
							->where(['building_id' => $r_info['b']])
							->asArray()
							->one();

SELECT `name` FROM `order_relationship_address` WHERE `order_id`='1802159381722'
---
		[ 'attribute' => 'order0.name',
			'format' => 'raw',
			'value' => function ( $model ) {
				$name = OrderRelationshipAddress::find()->select( 'name' )->where( [ 'order_id' => $model->order_id ] )->asArray()->one();

SELECT `name`, `order_basic_status` FROM `status` ORDER BY `name`
---
		],
		/* ['attribute' => 'invoice_id',
			'hAlign' => 'center'],*/
		[ 'attribute' => 'status',
			'value' => 'status0.name',
			//'refreshGrid' => true,
			'filterType' => GridView::FILTER_SELECT2,
			'filter' => Status::find()->select( [ 'name', 'order_basic_status' ] )->orderBy( 'name' )->indexBy( 'order_basic_status' )->column(),
			'filterInputOptions' => [ 'placeholder' => '' ],
			'filterWidgetOptions' => [
				'pluginOptions' => [ 'allowClear' => true ],
			],
			'class' => 'kartik\grid\EditableColumn',
			// 判断活动列是否可编辑
			'readonly' => function ( $model, $key, $index, $widget ) {
				return ( $model->status != 1 );
			},
			'editableOptions' => [
				'formOptions' => [ 'action' => [ '/order/order' ] ], // point to the new action
				'inputType' => \kartik\ editable\ Editable::INPUT_DROPDOWN_LIST,
				'data' => [ '1' => '未支付', '2' => '已支付', '3' => '已取消', '4' => '送货中', '5' => '已签收' ],
			],
			'contentOptions' =>
			function ( $model ) {