backend/models/TicketBasic.php

	public static function getPengdingCommentCount()
	{
		$c = $_SESSION['user']['community'];
		if(empty($c)){
			return TicketBasic::find()->where(['ticket_status' =>1])->count();
		}else{
			return TicketBasic::find()->andwhere(['ticket_status' => 1])->andwhere(['community_id' => $c])->count();
---
SELECT COUNT(*) FROM `ticket_basic` WHERE `ticket_status`=1
SELECT COUNT(*) FROM `ticket_basic` WHERE (`ticket_status`=1) AND (`community_id`=22)