backend/models/User.php

SELECT * FROM `sys_user` WHERE `name`='金座小区'
---
    public static function findByUsername($username)
    {
          $user = User::find()
            ->where(['name' => $username])
            ->asArray()
            ->one();