backend/views/costrelation/index.php

SELECT `community_name`, `community_id` FROM `community_basic` ORDER BY `community_name`
---
            function (data) {
                $('.modal-body').html(data);
            }
        );
    });
JS;
$this->registerJs( $uJs );

Modal::end();


/* @var $this yii\web\View */
/* @var $searchModel app\models\CostRelationSearch */
/* @var $dataProvider yii\data\ActiveDataProvider */

$this->title = '费项列表';
$this->params[ 'breadcrumbs' ][] = $this->title;
?>
<div class="cost-relation-index">

	<?php
	$gridColumn = [
		[ 'class' => 'kartik\grid\SerialColumn',
			'header' => '序<br />号'
		],

		//'id',
		[ 'attribute' => 'community',
			'value' => 'c.community_name',
			'filterType' => GridView::FILTER_SELECT2,
			'filter' => CommunityBasic::find()->select( [ 'community_name', 'community_id' ] )->orderBy( 'community_name' )->indexBy( 'community_id' )->column(),